1. 指令的职责就是当其表达式的改变时,将某些行为应用到DOM上,比如更新DOM的属性和触发事件

2. 过滤器可以用在两个地方：mustache 插值和 v-bind 表达式。过滤器应该被添加在 JavaScript 表达式的尾部，由“管道”符指示
Vue 2.x 中，过滤器只能在 mustache 绑定和 v-bind 表达式（从 2.1.0 开始支持）中使用，因为过滤器设计目的就是用于文本转换。为了在其他指令中实现更复杂的数据变换，你应该使用计算属性。

3. v-bind 缩写
<!-- 完整语法 -->
<a v-bind:href="url"></a>
<!-- 缩写 -->
<a :href="url"></a>
v-on 缩写

<!-- 完整语法 -->
<a v-on:click="doSomething"></a>
<!-- 缩写 -->
<a @click="doSomething"></a>

4. computed 与 methods都能实现过滤,但是computed有依赖缓存,处理数组和大量计算时性能更优

5. 使用watch时允许我们执行异步操作,这是计算属性所不具备的

6. 当 v-bind:style 使用需要特定前缀的 CSS 属性时，如 transform ，Vue.js 会自动侦测并添加相应的前缀。

7. v-show 不支持 <template> 语法，也不支持 v-else。但是v-if支持
如同 v-if 模板，你也可以用带有 v-for 的 <template> 标签来渲染多个元素块。

8. 在 v-for 块中，我们拥有对父作用域属性的完全访问权限。 v-for 还支持一个可选的第二个参数为当前项的索引。

9. 告诉你在组件中 data 必须是一个函数,理解这个跟理解闭包差不多,每一个组件实例返回全新的data,并且之间相互不受影响

10. 父子组件的关系可以总结为 props down, events up 。

11. 编写可复用组件时需要注意:
Props 允许外部环境传递数据给组件
Events 允许组件触发外部环境的副作用
Slots 允许外部环境将额外的内容组合在组件中。

12. 命名路由的好处是提高路由的可维护性

13. 命名视图的好处是可同级展示多个视图,而不是嵌套

14. 重定向与别名的区别:
重定向 URL会被替换 然后匹配替换的路由
别名 别名的URL不会被替换 但是路由匹配的还是真正的命名路由

15. 实例创建之后，可以通过 vm.$data 访问原始数据对象。Vue 实例也代理了 data 对象上所有的属性，因此访问 vm.a 等价于访问 vm.$data.a。

16. 不应该使用箭头函数来定义计算属性函数 (例如 aDouble: () => this.a * 2)。理由是箭头函数绑定了父级作用域的上下文，所以 this 将不会按照期望指向 Vue 实例，this.a 将是 undefined。

不应该使用箭头函数来定义 method 函数 (例如 plus: () => this.a++)。理由是箭头函数绑定了父级作用域的上下文，所以 this 将不会按照期望指向 Vue 实例，this.a 将是 undefined。

不应该使用箭头函数来定义 watcher 函数
